loadTest.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
  processor: "./loadArtillery.js"
scenarios:
  - name: "Spell Words"
    flow:
      - post:
          url: "/spell"
          json:
            locale: 'en_us'
            words: []